START_MSG = """
Начать пользоваться ботом можно уже сейчас.
Просто отправьте или перешлите сообщение.

Для кастомизации подкастов изучите меню с настройками.
"""

EXAMPLE_AUDIO = """
Пример звучания фразы "В недрах тундры выдры в гетрах тырят в вёдра ядра кедров": 
""" 

SMALL_MESSAGE = "Привет, моя собака милая!"

BIG_MESSAGE = """
Методичка-вопросник рассерженного патриота. (Сборник вопросов к представителям власти и пропагандонам-охранителям, по которым хотелось-бы получить конкретные прямые и честные ответы, с вытекающими орг-выводами).

I. Вопросы "исторические":

1) В 2014-м году власть укро-хунты висела на волоске, вся Новороссия - глядя на Крым - с надеждой ждала Россию. Но Кремль сначала отказался от ввода миротворческих сил в Донбасс, а потом первым в мире признал легитимность избрания Порошенко. В результате 8-летней "минской тягомотины" власти т.н. "украина" создали боеспособную армию, подавили протестное движение, промыли мозги значительной части населения и к 2022 году оказались в состоянии противостоять ВС РФ на поле боя. КТО отвечает за стратегически -провальные решения, за которые сейчас Россия расплачивается тысячами жизней и десятками тысяч калек? Кто понёс или должен понести наказание за данный кретинизм и/или прямое вредительство?

2) Почему во главе Народных республик Донбасса были поставлены (и сейчас состоят) откровенные жулики и мошенники, дескридитировавшие идеи Русской Весны самим фактом своего присутствия во власти? Как и каким образом были устранены физически наиболее известные и авторитетные герои 2014-го года из числа командиров ополчения? Кто понёс или понесёт ответственность за то, что вместо "витрины Русского Мира" в ЛДНР 8 лет существовал "отстойник", в котором людям жилось значительно хуже, чем в РФ и хуже, чем на "украине"?

3) Как получилось, что президента РФ (по его собственному личному признанию) "восемь лет водили за нос уважаемые киевские и дорогие западные партнеры" в рамках "безальтернативных минских соглашений" и "нормандского формата"? Где были принципиальные и профессионально-пригодные советники и чиновники, которые были обязаны предупредить президента о том ,что было очевидно множеству сторонних наблюдателей, не получающих государственного содержания? Наказаны ли как-либо данные чиновники или хотя-бы отстранены от дальнейшего исполнения обязанностей?

4) Какова роль целого ряда высокопоставленных российских чиновников (Суркова, на пример) в том, что осенью 2014 года ополчения ДНР и ЛНР, совместно с "Северным Ветром" не смогли выйти на границы указанных республик, преследуя уже беспорядочно отступавшие ВСУ? Почему фронт оказался "зафиксирован" на окраинах Донецка? Почему не был освобожден оставленный ВСУ Мариуполь? Какую роль в этом играли закулисные переговоры Суркова (и других представителей кремлевского вип-чиновничества) с украинскими олигархами и, в частности, с Ринатом Ахметовым? Почему - после освобождения Дебальцева весной 2015 года - боевые действия были вновь "заморожены" и ВСУ получили шанс на восстановление вновь потерянной боеспособности?

5) Отчего за 8 лет ,-пока ВСУ лихорадочно вооружались и готовились к большой войне - соединения и подразделения Народной Милиции ЛДНР влачили жалкое существование, получали крайне скудное снабжение и имели на вооружении устаревшие системы вооружения? Почему они практически не проходили нормальной боевой подготовки и слаживания? Кто отвечал за эти вопросы в МО РФ и кто должен ответить за преступно-вредительское отношение к боеспособности Корпусов Народной Милиции?
"""