

SPEAKER_MAP = {
    "dmitry": "eugene",
    "ksenia": "xenia",
    "viktor": "aidar",
    "anna": "kseniya"
}


PRONUNCIATION_DICT = {
    'А': 'а',
    'Б': 'бэ',
    'В': 'вэ',
    'Г': 'гэ',
    'Д': 'дэ',
    'Е': 'е',
    'Ё': 'ё',
    'Ж': 'жэ',
    'З': 'зэ',
    'И': 'и',
    'Й': 'ий',
    'К': 'кэ',
    'Л': 'эл',
    'М': 'эм',
    'Н': 'эн',
    'О': 'о',
    'П': 'пэ',
    'Р': 'эр',
    'С': 'эс',
    'Т': 'тэ',
    'У': 'у',
    'Ф': 'эф',
    'Х': 'ха',
    'Ц': 'цэ',
    'Ч': 'чэ',
    'Ш': 'ша',
    'Щ': 'ща',
    'Ъ': 'Ъ',
    'Ы': 'ы',
    'Ь': 'Ь',
    'Э': 'э',
    'Ю': 'ю',
    'Я': 'я'
}

SHORTCUTS = {
    "т.е.": "то есть",
    "т.к.": "так как",
    "т.д.": "и так далее",
    "т.н.": "так называемый",
    "т.п.": "и тому подобное",
    "напр.": "например",
    "и пр.": "и прочее",
    "и др.": "и другое",
    "и т.д.": "и так далее",
    "и т.п.": "и так далее, и прочее",
    "в т.ч.": "в том числе",
    "вкл.": "включая",
    "см.": "смотри",
    "и/или": "и",
}

EMOTIONS = ["neutral", "positive", "negative"]
