{"update_id": 942109636, "message": {"message_id": 827, "from": {"id": 762583084, "is_bot": false, "first_name": "Irina", "last_name": "Maximova", "username": "irusvirus", "language_code": "ru"}, "chat": {"id": 762583084, "first_name": "Irina", "last_name": "Maximova", "username": "irusvirus", "type": "private"}, "date": 1683728942, "forward_from_chat": {"id": -1001762403226, "title": "Московский зоопарк", "username": "Moscowzoo_official", "type": "channel"}, "forward_from_message_id": 3386, "forward_date": 1683622738, "photo": [{"file_id": "AgACAgIAAxkBAAIDO2Rbqi70sTaAWrWjDNh8QVwejU-6AALPxTEbsSHRSk5ni6UcT2pQAQADAgADcwADLwQ", "file_unique_id": "AQADz8UxG7Eh0Up4", "file_size": 1159, "width": 90, "height": 57}, {"file_id": "AgACAgIAAxkBAAIDO2Rbqi70sTaAWrWjDNh8QVwejU-6AALPxTEbsSHRSk5ni6UcT2pQAQADAgADbQADLwQ", "file_unique_id": "AQADz8UxG7Eh0Upy", "file_size": 14270, "width": 320, "height": 201}, {"file_id": "AgACAgIAAxkBAAIDO2Rbqi70sTaAWrWjDNh8QVwejU-6AALPxTEbsSHRSk5ni6UcT2pQAQADAgADeAADLwQ", "file_unique_id": "AQADz8UxG7Eh0Up9", "file_size": 23786, "width": 592, "height": 371}], "caption": "Великая Отечественная война потрясла всю страну. Зоопарк не стал исключением.\n\nС первых же дней штат сократили. До войны было около 750 человек, во время – всего 225 человек. Фактически все – женщины.\n\nНовую территорию закрыли, хотя часть животных там оставалась. На Острове зверей устроили склад боеприпасов. Посреди Детского зоопарка располагалась зенитка.\n\nНа Новой территории, стояла воинская часть, прибывшая с Дальнего Востока. Воины этой части перелезали через забор и приносили для животных остатки пищи из столовой.\n\nХищников стали кормить мясом павших лошадей. Зоопарк получал по телефону сведения обо всех павших в Москве лошадях. Сотрудники тут же собирались и ехали за ними.\n\nЗоопарк был дважды под обстрелом: с 22 на 23 июля 1941 года и с 4 на 5 января 1942 года.\n\nВо время первого налета в ночь с 22 на 23 июля сгорели управление зоопарка, архивы, ресторан. Сгорели также квартиры сотрудников Закусилло, Колесниковых, Марковой на территории парка. Они не пошли спасать свои вещи, а остались на своих объектах и тушили зажигательные бомбы.\n\nВ ночь с 4 января 1942 года на Новую территорию были сброшены 2 фугасные бомбы, которые попали в Остров зверей. Не успели затушить львятник и обезьянник, как прибежал связной и сказал, что горит слоновник. В этот день был сильный мороз, примерно 30 градусов, и там находились ценные теплолюбивые животные, необходимо было немедленно забить окна. Буквально за какие-нибудь 20 минут все окна и пробоины были заделаны и помещение утеплено.\n\nЗоопарк не закрывался даже в войну. И даже смог отметить 80-летие в 1944 году. Как написали в «Вечерней Москве»: «За два с половиной года войны здесь перебывало 2 млн. человек, причем полмиллиона было детей\".\n\nСвоим выживанием Зоопарк напрямую обязан женскому героизму. Почти все мужчины ушли на фронт. До тех пор считалось, что женщина никогда не сможет обеспечить хороший уход за крупными и опасными хищниками. Действительность показала иное. Женщины не только спасли Зоопарк от разрушения, но и сохранили жизнь тысячам его обитателей."}}