{"update_id": 942109860, "message": {"message_id": 1320, "from": {"id": 762583084, "is_bot": false, "first_name": "Irina", "last_name": "Maximova", "username": "irusvirus", "language_code": "en"}, "chat": {"id": 762583084, "first_name": "Irina", "last_name": "Maximova", "username": "irusvirus", "type": "private"}, "date": 1684149457, "forward_from_chat": {"id": -1001003921752, "title": "BBC News | Русская служба", "username": "bbcrussian", "type": "channel"}, "forward_from_message_id": 45948, "forward_date": 1683633972, "text": "Парад Победы 9 мая 2023 года оказался самым скромным за последние годы. Корреспондент Би-би-си Павел Аксенов о том, какую технику показали на параде в Москве\n\nЕдинственным танком, проехавшим по Красной площади, был ветеран Второй мировой Т-34. Обычно на параде Россия демонстрирует новую технику, а также традиционный набор разработок российского ВПК 2010-х годов – танк Т-14 и БМП Т-15 семейства \"Армата\", самоходки \"Коалиция\", БМП \"Курганец\" и восьмиколесные бронемашины \"Бумеранг\".\n\nВ этом году, судя по публикациям в российской прессе перед парадом, на Красной площади собирались показать условно новые танки Т-72Б3М, слегка доработанные по военному опыту, новые бронеавтомобили \"Ахмат\" и \"ВПК-Урал\", а также уже привычные танки Т-90М, Т-72Б3, ядерные ракеты \"Ярс\" и \"Бумеранги\".\n\nВ результате по площади проехала только колесная техника, причем диктор почему-то не стал произносить слово \"Ахмат\", назвав бронемашину, которая официально так называется, \"защищенным транспортным средством на базе автомобиля КамАЗ\". Эту бронемашину, как утверждает глава Чечни Рамзан Кадыров, создали по его личной просьбе.\n\nПарад обошелся без воздушной части, о возможной отмене которой заранее говорил пресс-секретарь Путина Дмитрий Песков. Обычно пролет самолетов и вертолетов отменяют из-за плохой погоды, но в этом году 9 мая над Москвой было ясное небо.\n\nЕще одна особенность этого парада – присутствие на трибунах наемников из ЧВК \"Вагнер\", которых диктор назвал \"бойцами штурмовых отрядов\". Именно так вагнеровцев чаще всегоназывают в сводках Минобороны (например, в последней, опубликованной накануне 9 мая).\n\nОрганизовывая парад Победы в 2023 году, российские власти, очевидно, оказались в непростой ситуации. Во-первых, в прошлом году после традиционного парада с \"Арматами\", \"Курганцами\" и \"Коалициями\" в пророссийских аккаунтах различных соцсетей появилось много комментариев с вопросом \"А почему вся эта новейшая техника отсутствует на фронте?\"\n\nСпустя год эти машины смотрелись бы еще более контрастно на фоне старых советских танков и бронемашин 1960-х годов, которые, судя по видеороликам в тех же соцсетях, везут на фронт.\nВо-вторых, перед самым парадом обострились отношения между главой ЧВК \"Вагнер\" Евгением Пригожиным и Минобороны. Пригожин выступил с резкой критикой российского командования, буквально обложив его матом. Возможно, этим можно объяснить тот факт, что диктор ни разу не произнес слово \"Вагнер\".\n\nИ, наконец, самое главное – за шесть дней до парада в ста метрах от того места, где стоял Владимир Путин, над крышей Сенатского дворца взорвались два дрона. Хотя руководство Украины официально объявило о непричастности к этой атаке, в Кремле заявили, что за ней стоят Киев и Вашингтон.\n\nИменно угрозой внезапного появления беспилотников можно объяснить отмену воздушной части парада. Над Красной площадью на небольшой высоте должны были лететь десятки самолетов, включая стратегические бомбардировщики, тяжелые транспортные \"Русланы\" и многие другие летательные аппараты. Достаточно было одному дрону оказаться у них на пути, чтобы порядок воздушного строя смешался – риск авиационного происшествия в такой ситуации очень высок.\n\nЕсли ссылка не открывается, нажмите здесь.", "entities": [{"offset": 0, "length": 159, "type": "bold"}, {"offset": 211, "length": 11, "type": "text_link", "url": "https://www.bbc.com/russian/features-65535944?ocid=wsrussian.social.in-app-messaging.telegram..russiantelegram_.edit"}, {"offset": 3150, "length": 28, "type": "italic"}, {"offset": 3178, "length": 13, "type": "text_link", "url": "https://storage.googleapis.com/sitecopy/www.bbc.com/f842ecf5.html"}, {"offset": 3178, "length": 13, "type": "italic"}, {"offset": 3191, "length": 1, "type": "italic"}]}}